{"model": "DenseNeuralNetworkClassifier", "analisis_options": {"limit_to_categoric": 16}, "preprocessing_options": {"test_size": 0.3, "target_col_name": "bullyied", "all_mean_encoding": false, "one_hot_encoding": true, "ordinal_encoding": false, "all_cols_numeric_encoding": true, "binary_encoder": null, "categoric_encoder": "catBoostEncodder", "jerarquic_encoder": null, "numeric_encoder": null, "scaler": "standardScaler", "binary_col_list": [], "categoric_col_list": ["q1 Custom Age", "q2 Sex", "q3 In what grade are you", "q6 How often went hungry", "q10 Fast food eating ", "q15 Physically attacked", "q16 Physical fighting", "q17 Seriously injured", "q18 Serious injury type ", "q19 Serious injury cause", "q22 Felt lonely", "q23 Could not sleep", "q24 Considered suicide", "q25 Made a suicide plan", "q26 Attempted suicide", "q27 Close friends", "q28 Initiation of cigarette use", "q29 Current cigarette use", "q30 Other tobacco use", "q31 Smoking cessation", "q32 Smoking in their presence", "q33 Parental tobacco use", "q34 Initiation of alcohol use", "q35 Current alcohol use", "q36 Drank 2+ drinks ", "q37 Source of alchohol", "q38 Really drunk", "q39 Trouble from drinking", "q40 Initiation of drug use", "q41 Ever marijuana use", "q42 Current marijuana use ", "q43 Amphethamine or methamphetamine use", "q44 Ever sexual intercourse", "q45 Age first had sex", "q46 Number of sex partners", "q47 Condom use", "q48 Birth control used ", "q49 Physical activity past 7 days", "q50 Walk or bike to school", "q51 PE attendance", "q52 Sitting activities", "q53 Miss school no permission", "q54 Other students kind and helpful ", "q55 Parents check homework ", "q56 Parents understand problems", "q57 Parents know about free time", "q58 Parents go through their things", "q61 Fruit consumption past 7 days", "q62 Vegetable consumption past 7 days", "q63 Soft drink consumption past 7 days ", "qn69 Were underweight"], "jerarquic_col_dict": null, "numeric_col_list": [], "X_train_shape": [20525, 51], "y_train_shape": [20525], "X_test_shape": [8797, 51], "y_test_shape": [8797, 51], "train_target_col_yes_number": 7898, "train_target_col_no_number": 12627, "test_target_col_yes_number": 3398, "test_target_col_no_number": 5399}, "modeling_options": {"max_precission": false, "cv_method": "grid_cv"}, "metrics": {"51": {"columns": ["q1 Custom Age", "q2 Sex", "q3 In what grade are you", "q6 How often went hungry", "q10 Fast food eating ", "q15 Physically attacked", "q16 Physical fighting", "q17 Seriously injured", "q18 Serious injury type ", "q19 Serious injury cause", "q22 Felt lonely", "q23 Could not sleep", "q24 Considered suicide", "q25 Made a suicide plan", "q26 Attempted suicide", "q27 Close friends", "q28 Initiation of cigarette use", "q29 Current cigarette use", "q30 Other tobacco use", "q31 Smoking cessation", "q32 Smoking in their presence", "q33 Parental tobacco use", "q34 Initiation of alcohol use", "q35 Current alcohol use", "q36 Drank 2+ drinks ", "q37 Source of alchohol", "q38 Really drunk", "q39 Trouble from drinking", "q40 Initiation of drug use", "q41 Ever marijuana use", "q42 Current marijuana use ", "q43 Amphethamine or methamphetamine use", "q44 Ever sexual intercourse", "q45 Age first had sex", "q46 Number of sex partners", "q47 Condom use", "q48 Birth control used ", "q49 Physical activity past 7 days", "q50 Walk or bike to school", "q51 PE attendance", "q52 Sitting activities", "q53 Miss school no permission", "q54 Other students kind and helpful ", "q55 Parents check homework ", "q56 Parents understand problems", "q57 Parents know about free time", "q58 Parents go through their things", "q61 Fruit consumption past 7 days", "q62 Vegetable consumption past 7 days", "q63 Soft drink consumption past 7 days ", "qn69 Were underweight"], "best_params": {"batch_size": 256, "dropout": 0.1, "epochs": 50, "learning_rate": 0.001, "regularization": 0.001, "units": 512}, "metrics": {"metrics": {"accuracy": 69.122, "sensibility": 27.266, "specifity": 74.919, "A": {"TP": 0, "FP": 0}, "B": {"TP": 2, "FP": 0}, "C": {"TP": 726, "FP": 387}, "D": {"TN": 2312, "FN": 971}, "ALL": {"TP": 728, "FP": 387, "TN": 2312, "FN": 971}}}, "NNconfig": {"name": "sequential_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 51], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_56_input"}}, {"class_name": "Dense", "config": {"name": "dense_56", "trainable": true, "batch_input_shape": [null, 51], "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_57", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_58", "trainable": true, "dtype": "float32", "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_50", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_59", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_51", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_60", "trainable": true, "dtype": "float32", "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_52", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_53", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}}